configuration/src/InformationRegisters/SynchronizationCircuit/SynchronizationCircuit.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SynchronizationCircuit</name>
  <resources>
    <name>NodeName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>125</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>PeerInfobaseNodeName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>125</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IsSyncDeleted</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>LatestUpdate</name>
    <comment>Время по Гринвичу</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Looping</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>InfobaseNode</name>
    <comment>ACC:1330 универсальный механизм</comment>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>NodeCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>CorrespondentNodeCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/CommonInfobasesNodesSettings/CommonInfobasesNodesSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CommonInfobasesNodesSettings</name>
  <resources>
    <name>AdjustMappingData</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InitialDataExport</name>
    <comment>Flag for initial data upload</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>DeleteUserForDataSync</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>ExecuteDataSending</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SettingCompleted</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InitialImageCreated</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>MessageForDataMapping</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>CorrespondentVersion</name>
    <comment>The version of the configuration information of the base-correspondent</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IsLoopDetected</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ExchangeDataRegistrationOnLoop</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UseScenariosInSaaS</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UseConnectionsSettingsInSaaS</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>SynchronizationIsUnavailable</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>CorrespondentExchangePlanName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>SentNo</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SentNumberInitialDataExport</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CorrespondentPrefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MigrationToWebService_Step</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MigrationToWebService_PeerEndpoint</name>
    <type>
      <types>DefinedType.MessagesQueueEndpoint</types>
    </type>
  </attributes>
  <attributes>
    <name>MigrationToWebService_Endpoint</name>
    <type>
      <types>DefinedType.MessagesQueueEndpoint</types>
    </type>
  </attributes>
  <attributes>
    <name>MigrationToWebService_DataArea</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>InfobaseNode</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ObjectsUnregisteredDuringLoop/ObjectsUnregisteredDuringLoop.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ObjectsUnregisteredDuringLoop</name>
  <resources>
    <name>InformationRegisterName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>InformationRegisterChanges</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ObjectPresentation</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>InfobaseNode</name>
    <comment>ACC:1330 универсальный механизм</comment>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Object</name>
    <comment>ACC:1330 универсальный механизм</comment>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>InformationRegisterKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/SynchronizationCircuit/Forms/SynchronizationLoop/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region EventHandlersForm

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Items.InfoLoopDetected.Title = StringFunctions.FormattedString(
		Items.InfoLoopDetected.Title, 
		DataExchangeLoopControl.AllLoopedNodesPresentation());
		
	Query = New Query;
	Query.Text = 
		"SELECT
		|	Settings.InfobaseNode AS InfobaseNode,
		|	Settings.ExchangeDataRegistrationOnLoop AS ExchangeDataRegistrationOnLoop
		|FROM
		|	InformationRegister.CommonInfobasesNodesSettings AS Settings
		|WHERE
		|	Settings.IsLoopDetected";
	
	Table = Query.Execute().Unload();
	NodeTable_.Load(Table);
	
	If NodeTable_.Count() > 0 Then
		
		Items.GroupThisInfobase.Visible = True;
		Items.GroupAnotherInfobase.Visible = False;
		
	Else
		
		Items.GroupThisInfobase.Visible = False;
		Items.GroupAnotherInfobase.Visible = True;
		
		Items.InformationAnotherInfobase.Title = StringFunctions.FormattedString(
			Items.InformationAnotherInfobase.Title,
			DataExchangeLoopControl.InfobaseWithSuspendedRegistrationPresentation());
		
	EndIf;
		
	SetConditionalAppearance();
		
EndProcedure

#EndRegion

#Region NodeTable_FormTableItemEventHandlers

&AtClient
Procedure NodeTable_Selection(Item, RowSelected, Field, StandardProcessing)
	
	If Field.Name = "NodeTable_ExchangeDataRegistrationOnLoop" Then
		
		String = NodeTable_.FindByID(RowSelected);
		String.ExchangeDataRegistrationOnLoop = Not String.ExchangeDataRegistrationOnLoop;
		
		PauseResumeRegistration(String.InfobaseNode, String.ExchangeDataRegistrationOnLoop);
		
	ElsIf Field.Name = "NodeTable_UnregistreredData" Then
		
		String = NodeTable_.FindByID(RowSelected);
		FormParameters = New Structure("InfobaseNode", String.InfobaseNode);
		
		OpenForm("InformationRegister.ObjectsUnregisteredDuringLoop.ListForm", FormParameters);
		
	EndIf;
	
EndProcedure

&AtServer
Procedure PauseResumeRegistration(InfobaseNode, ExchangeDataRegistrationOnLoop)
	
	SetPrivilegedMode(True);
	
	Try 
		
		InformationRegisters.CommonInfobasesNodesSettings.SetLoop(
			InfobaseNode,, 
			ExchangeDataRegistrationOnLoop);
		
	Except
		
		WriteLogEvent(, EventLogLevel.Error,,, ErrorProcessing.DetailErrorDescription(ErrorInfo()));
		
	EndTry;
	
EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure CloseForm(Command)
	
	Close();
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure SetConditionalAppearance()
	
	ConditionalAppearance.Items.Clear();
	
	// 
	Item = ConditionalAppearance.Items.Add();
	
	ItemField = Item.Fields.Items.Add();
	ItemField.Field = New DataCompositionField("NodeTable_ExchangeDataRegistrationOnLoop");
	
	ItemFilter = Item.Filter.Items.Add(Type("DataCompositionFilterItem"));
	ItemFilter.LeftValue = New DataCompositionField("NodeTable_.ExchangeDataRegistrationOnLoop");
	ItemFilter.ComparisonType = DataCompositionComparisonType.Equal;
	ItemFilter.RightValue = False;
	
	Text = NStr("en = 'Resume registration';");
	Item.Appearance.SetParameterValue("Text", Text);
	Item.Appearance.SetParameterValue("ReadOnly", True);
	Item.Appearance.SetParameterValue("TextColor", WebColors.Blue);
	
	// 
	Item = ConditionalAppearance.Items.Add();
	
	ItemField = Item.Fields.Items.Add();
	ItemField.Field = New DataCompositionField("NodeTable_ExchangeDataRegistrationOnLoop");
	
	ItemFilter = Item.Filter.Items.Add(Type("DataCompositionFilterItem"));
	ItemFilter.LeftValue = New DataCompositionField("NodeTable_.ExchangeDataRegistrationOnLoop");
	ItemFilter.ComparisonType = DataCompositionComparisonType.Equal;
	ItemFilter.RightValue = True;
	
	Text = NStr("en = 'Terminate registration';");
	Item.Appearance.SetParameterValue("Text", Text);
	Item.Appearance.SetParameterValue("ReadOnly", True);
	Item.Appearance.SetParameterValue("TextColor", WebColors.Blue);

	// Перейти
	Item = ConditionalAppearance.Items.Add();
	
	ItemField = Item.Fields.Items.Add();
	ItemField.Field = New DataCompositionField("NodeTable_UnregistreredData");
	
	ItemFilter = Item.Filter.Items.Add(Type("DataCompositionFilterItem"));
	ItemFilter.LeftValue = New DataCompositionField("NodeTable_.InfobaseNode");
	ItemFilter.ComparisonType = DataCompositionComparisonType.Filled;
	
	Text = NStr("en = 'Navigate';");
	Item.Appearance.SetParameterValue("Text", Text);
	Item.Appearance.SetParameterValue("ReadOnly", True);
	Item.Appearance.SetParameterValue("TextColor", WebColors.Blue);
	
EndProcedure

#EndRegion
